<?php

$data = [
    ['Иванов', 'Математика', 5],
    ['Иванов', 'Математика', 4],
    ['Иванов', 'Математика', 5],
    ['Петров', 'Математика', 5],
    ['Сидоров', 'Физика', 4],
    ['Иванов', 'Физика', 4],
    ['Петров', 'ОБЖ', 4],
];

$students_stats = [];
$lessons = [];

foreach ($data as $line){
    $students_stats[$line[0]][$line[1]] +=  $line[2];
    $lessons[] = $line[1];
}
/*
 * $students_stats = [ "Ученик-1" => [ "Предмет-1" => int(Оценка), ...,"Предмет-N" => int(Оценка) ],
 *                     ...,
 *                     "Ученик-N" => [ "Предмет-1" => int(Оценка), ...,"Предмет-N" => int(Оценка) ]
 *                    ];
 */
$lessons = array_unique($lessons);
asort($students_stats);
sort($lessons);

?>


